app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"