app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("tittle", "author", "total_pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tittle", "hahah"], ["author", "qualquer um"], ["total_pages", 113], ["created_at", "2016-07-03 15:05:42.800139"], ["updated_at", "2016-07-03 15:05:42.800139"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "tittle" = ?, "author" = ?, "total_pages" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["tittle", "Livro de Rails"], ["author", "Zézin"], ["total_pages", 500000], ["updated_at", "2016-07-03 12:30:16.326749"], ["id", 1]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]